import { z } from "zod";

export const ProfileSchema = z.object({
  name: z.string().trim()
    .min(1, "Имя обязательно")
    .max(50, "Имя слишком длинное (макс. 50)"), // 👈 Добавь лимиты как в БД

  bio: z.string().trim()
    .max(300, "О себе: максимум 500 символов") // 👈 Лимит как в БД
    .optional(),

  website: z.string()
    .trim()
    .max(100, "Ссылка слишком длинная (макс. 255 символов)") // 👈 ВОТ ЭТОГО НЕ ХВАТАЛО
    .url("Некорректный формат ссылки (должна начинаться с http:// или https://)")
    .optional()
    .or(z.literal("")),

  github_username: z.string().trim()
    .max(50, "Никнейм слишком длинный")
    .optional(),

  skills: z.string().trim()
    .max(20, "Слишком много текста")
    .optional(),
});

export type ProfileSchema = z.infer<typeof ProfileSchema>;